In [1]:
import pandas as pd
import numpy as np

In [8]:
# df = pd.Series([1,2,3,np.nan,np.nan,5])
df = pd.DataFrame([[2,np.nan,4], [4,6,7], [np.nan,7,8]])
df

     0    1  2
0  2.0  NaN  4
1  4.0  6.0  7
2  NaN  7.0  8

In [4]:
df.isnull().sum()  #đếm giá trị null

2

In [10]:
df.dropna(how = "all")   #xóa giá trị null   #how = 'all' => xóa giá trị nếu dòng đó đều null

     0    1  2
0  2.0  NaN  4
1  4.0  6.0  7
2  NaN  7.0  8

In [14]:
df.iloc[:3,:2]  # lọc (hàng, cột)

     0    1
0  2.0  NaN
1  4.0  6.0
2  NaN  7.0

In [18]:
df.dropna(thresh = 3) #hiện ra các hàng có ít nhất 3 giá trị not null

     0    1  2
1  4.0  6.0  7

In [20]:
df.fillna(1, inplace = True) #thay các giá trị null = 1, #Inplace = True: ko thay thế df cũ

     0    1  2
0  2.0  1.0  4
1  4.0  6.0  7
2  1.0  7.0  8

In [22]:
df

     0    1  2
0  2.0  NaN  4
1  4.0  6.0  7
2  NaN  7.0  8

In [23]:
display(df)
df.fillna(method = 'bfill')  #bfill: lấy giá trị cho null (từ dưới lên)

     0    1  2
0  2.0  NaN  4
1  4.0  6.0  7
2  NaN  7.0  8

     0    1  2
0  2.0  6.0  4
1  4.0  6.0  7
2  NaN  7.0  8

In [30]:
df = pd.DataFrame({'sample1':['one','two'] * 3 + ['three'],
                  'sample2':[1,2,3,4,5,6,7]})
display(df)
df.drop_duplicates(['sample1'], keep = 'last')

  sample1  sample2
0     one        1
1     two        2
2     one        3
3     two        4
4     one        5
5     two        6
6   three        7

  sample1  sample2
4     one        5
5     two        6
6   three        7

In [40]:
df = pd.DataFrame({'sample1':['one','two'] * 3 + ['three'],
                  'sample2':[1,2,3,4,5,6,7]})
# display(df)
# df.drop_duplicates(['sample1'], keep = 'last')    

# df['sample1'] = df['sample1'].map({'one': 1, 'two':2, 'three':3})
# df['sample1']= df['sample1'].map(lambda x: x == 'a')
# df['sample1'] = df['sample1'].map(lambda x: 1 if x == 'one' else 2)
# df['sample1'] = df['sample1'].replace('one',1)
# df['sample1'] = df['sample1'].replace(['one','two'],[1,2])
df['sample1'] = df['sample1'].replace({'one':1})
df

  sample1  sample2
0       1        1
1     two        2
2       1        3
3     two        4
4       1        5
5     two        6
6   three        7